OpenNuvoton/ISPTool/Firmwares/M4521BSP/Library/Device/Nuvoton/M4521/Include/M4521.h
#define SYS_IRCTCTL_LOOPSEL_Pos          (4)                                               /*!< SYS_T::IRCTCTL: LOOPSEL Position          */
#define SYS_IRCTCTL_LOOPSEL_Msk          (0x3ul << SYS_IRCTCTL_LOOPSEL_Pos)                /*!< SYS_T::IRCTCTL: LOOPSEL Mask              */

#define SYS_IRCTCTL_RETRYCNT_Pos         (6)                                               /*!< SYS_T::IRCTCTL: RETRYCNT Position         */
#define SYS_IRCTCTL_RETRYCNT_Msk         (0x3ul << SYS_IRCTCTL_RETRYCNT_Pos)               /*!< SYS_T::IRCTCTL: RETRYCNT Mask             */

#define SYS_IRCTCTL_CESTOPEN_Pos         (8)                                               /*!< SYS_T::IRCTCTL: CESTOPEN Position         */
#define SYS_IRCTCTL_CESTOPEN_Msk         (0x1ul << SYS_IRCTCTL_CESTOPEN_Pos)               /*!< SYS_T::IRCTCTL: CESTOPEN Mask             */

#define SYS_IRCTIEN_TFAILIEN_Pos         (1)                                               /*!< SYS_T::IRCTIEN: TFAILIEN Position         */
#define SYS_IRCTIEN_TFAILIEN_Msk         (0x1ul << SYS_IRCTIEN_TFAILIEN_Pos)               /*!< SYS_T::IRCTIEN: TFAILIEN Mask             */

#define SYS_IRCTIEN_CLKEIEN_Pos          (2)                                               /*!< SYS_T::IRCTIEN: CLKEIEN Position          */
#define SYS_IRCTIEN_CLKEIEN_Msk          (0x1ul << SYS_IRCTIEN_CLKEIEN_Pos)                /*!< SYS_T::IRCTIEN: CLKEIEN Mask              */

#define SYS_IRCTISTS_FREQLOCK_Pos        (0)                                               /*!< SYS_T::IRCTISTS: FREQLOCK Position        */
#define SYS_IRCTISTS_FREQLOCK_Msk        (0x1ul << SYS_IRCTISTS_FREQLOCK_Pos)              /*!< SYS_T::IRCTISTS: FREQLOCK Mask            */

#define SYS_IRCTISTS_TFAILIF_Pos         (1)                                               /*!< SYS_T::IRCTISTS: TFAILIF Position         */
#define SYS_IRCTISTS_TFAILIF_Msk         (0x1ul << SYS_IRCTISTS_TFAILIF_Pos)               /*!< SYS_T::IRCTISTS: TFAILIF Mask             */

#define SYS_IRCTISTS_CLKERRIF_Pos        (2)                                               /*!< SYS_T::IRCTISTS: CLKERRIF Position        */
#define SYS_IRCTISTS_CLKERRIF_Msk        (0x1ul << SYS_IRCTISTS_CLKERRIF_Pos)              /*!< SYS_T::IRCTISTS: CLKERRIF Mask            */

#define SYS_REGLCTL_REGLCTL_Pos          (0)                                               /*!< SYS_T::REGLCTL: REGLCTL Position          */
#define SYS_REGLCTL_REGLCTL_Msk          (0xfful << SYS_REGLCTL_REGLCTL_Pos)               /*!< SYS_T::REGLCTL: REGLCTL Mask              */

#define SYS_IRC48MTCTL_FREQSEL_Pos       (0)                                               /*!< SYS_T::IRC48MTCTL: FREQSEL Position       */
#define SYS_IRC48MTCTL_FREQSEL_Msk       (0x3ul << SYS_IRC48MTCTL_FREQSEL_Pos)             /*!< SYS_T::IRC48MTCTL: FREQSEL Mask           */

#define SYS_IRC48MTCTL_LOOPSEL_Pos       (4)                                               /*!< SYS_T::IRC48MTCTL: LOOPSEL Position       */
#define SYS_IRC48MTCTL_LOOPSEL_Msk       (0x3ul << SYS_IRC48MTCTL_LOOPSEL_Pos)             /*!< SYS_T::IRC48MTCTL: LOOPSEL Mask           */

#define SYS_IRC48MTCTL_RETRYCNT_Pos      (6)                                               /*!< SYS_T::IRC48MTCTL: RETRYCNT Position      */
#define SYS_IRC48MTCTL_RETRYCNT_Msk      (0x3ul << SYS_IRC48MTCTL_RETRYCNT_Pos)            /*!< SYS_T::IRC48MTCTL: RETRYCNT Mask          */

#define SYS_IRC48MTCTL_CESTOPEN_Pos      (8)                                               /*!< SYS_T::IRC48MTCTL: CESTOPEN Position      */
#define SYS_IRC48MTCTL_CESTOPEN_Msk      (0x1ul << SYS_IRC48MTCTL_CESTOPEN_Pos)            /*!< SYS_T::IRC48MTCTL: CESTOPEN Mask          */

#define SYS_IRC48MTCTL_REFCKSEL_Pos      (10)                                              /*!< SYS_T::IRC48MTCTL: REFCKSEL Position      */
#define SYS_IRC48MTCTL_REFCKSEL_Msk      (0x1ul << SYS_IRC48MTCTL_REFCKSEL_Pos)            /*!< SYS_T::IRC48MTCTL: REFCKSEL Mask          */

#define SYS_IRC48MTIEN_TFAILIEN_Pos      (1)                                               /*!< SYS_T::IRC48MTIEN: TFAILIEN Position      */
#define SYS_IRC48MTIEN_TFAILIEN_Msk      (0x1ul << SYS_IRC48MTIEN_TFAILIEN_Pos)            /*!< SYS_T::IRC48MTIEN: TFAILIEN Mask          */

#define SYS_IRC48MTIEN_CLKEIEN_Pos       (2)                                               /*!< SYS_T::IRC48MTIEN: CLKEIEN Position       */
#define SYS_IRC48MTIEN_CLKEIEN_Msk       (0x1ul << SYS_IRC48MTIEN_CLKEIEN_Pos)             /*!< SYS_T::IRC48MTIEN: CLKEIEN Mask           */

#define SYS_IRC48MTISTS_FREQLOCK_Pos     (0)                                               /*!< SYS_T::IRC48MTISTS: FREQLOCK Position     */
#define SYS_IRC48MTISTS_FREQLOCK_Msk     (0x1ul << SYS_IRC48MTISTS_FREQLOCK_Pos)           /*!< SYS_T::IRC48MTISTS: FREQLOCK Mask         */

#define SYS_IRC48MTISTS_TFAILIF_Pos      (1)                                               /*!< SYS_T::IRC48MTISTS: TFAILIF Position      */
#define SYS_IRC48MTISTS_TFAILIF_Msk      (0x1ul << SYS_IRC48MTISTS_TFAILIF_Pos)            /*!< SYS_T::IRC48MTISTS: TFAILIF Mask          */

#define SYS_IRC48MTISTS_CLKERRIF_Pos     (2)                                               /*!< SYS_T::IRC48MTISTS: CLKERRIF Position     */
#define SYS_IRC48MTISTS_CLKERRIF_Msk     (0x1ul << SYS_IRC48MTISTS_CLKERRIF_Pos)           /*!< SYS_T::IRC48MTISTS: CLKERRIF Mask         */

/**@}*/ /* SYS_CONST */


typedef struct
{

    /**
     * @var SYS_INT_T::NMIEN
     * Offset: 0x00  NMI Source Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BODOUT    |BOD NMI Source Enable (Write Protect)
     * |        |          |0 = BOD NMI source Disabled.
     * |        |          |1 = BOD NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[1]     |IRC_INT   |IRC TRIM NMI Source Enable (Write Protect)
     * |        |          |0 = IRC TRIM NMI source Disabled.
     * |        |          |1 = IRC TRIM NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[2]     |PWRWU_INT |Power-Down Mode Wake-Up NMI Source Enable (Write Protect)
     * |        |          |0 = Power-down mode wake-up NMI source Disabled.
     * |        |          |1 = Power-down mode wake-up NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[4]     |CLKFAIL   |Clock Fail Detected NMI Source Enable (Write Protect)
     * |        |          |0 = Clock fail detected interrupt NMI source Disabled.
     * |        |          |1 = Clock fail detected interrupt NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[6]     |RTC_INT   |RTC NMI Source Enable (Write Protect)
     * |        |          |0 = RTC NMI source Disabled.
     * |        |          |1 = RTC NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[7]     |TAMPER_INT|TAMPER_INT NMI Source Enable (Write Protect)
     * |        |          |0 = Backup register tamper detected interrupt.NMI source Disabled.
     * |        |          |1 = Backup register tamper detected interrupt.NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[8]     |EINT0     |External Interrupt From PA.0, PD.2 Or PE.4 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PA.0, PD.2 or PE.4 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PA.0, PD.2 or PE.4 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[9]     |EINT1     |External Interrupt From PB.0, PD.3 Or PE.5 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.0, PD.3 or PE.5 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.0, PD.3 or PE.5 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[10]    |EINT2     |External Interrupt From PC.0 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PC.0 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PC.0 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[11]    |EINT3     |External Interrupt From PD.0 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PD.0 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PD.0 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[12]    |EINT4     |External Interrupt From PE.0 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PE.0 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PE.0 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[13]    |EINT5     |External Interrupt From PF.0 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PF.0 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PF.0 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[14]    |UART0_INT |UART0 NMI Source Enable (Write Protect)
     * |        |          |0 = UART0 NMI source Disabled.
     * |        |          |1 = UART0 NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[15]    |UART1_INT |UART1 NMI Source Enable (Write Protect)
     * |        |          |0 = UART1 NMI source Disabled.
     * |        |          |1 = UART1 NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var SYS_INT_T::NMISTS
     * Offset: 0x04  NMI source interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BODOUT    |BOD Interrupt Flag (Read Only)
     * |        |          |0 = BOD interrupt is deasserted.
     * |        |          |1 = BOD interrupt is asserted.
     * |[1]     |IRC_INT   |IRC TRIM Interrupt Flag (Read Only)
     * |        |          |0 = HIRC TRIM interrupt is deasserted.
     * |        |          |1 = HIRC TRIM interrupt is asserted.
     * |[2]     |PWRWU_INT |Power-Down Mode Wake-Up Interrupt Flag (Read Only)
     * |        |          |0 = Power-down mode wake-up interrupt is deasserted.
     * |        |          |1 = Power-down mode wake-up interrupt is asserted.
     * |[4]     |CLKFAIL   |Clock Fail Detected Interrupt Flag (Read Only)
     * |        |          |0 = Clock fail detected interrupt is deasserted.
     * |        |          |1 = Clock fail detected interrupt is asserted.
     * |[6]     |RTC_INT   |RTC Interrupt Flag (Read Only)
     * |        |          |0 = RTC interrupt is deasserted.
     * |        |          |1 = RTC interrupt is asserted.
     * |[7]     |TAMPER_INT|TAMPER_INT Interrupt Flag (Read Only)
     * |        |          |0 = Backup register tamper detected interrupt is deasserted.
     * |        |          |1 = Backup register tamper detected interrupt is asserted.
     * |[8]     |EINT0     |External Interrupt From PA.0, PD.2 Or PE.4 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PA.0, PD.2 or PE.4 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PA.0, PD.2 or PE.4 interrupt is asserted.
     * |[9]     |EINT1     |External Interrupt From PB.0, PD.3 Or PE.5 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.0, PD.3 or PE.5 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.0, PD.3 or PE.5 interrupt is asserted.
     * |[10]    |EINT2     |External Interrupt From PC.0 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PC.0 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PC.0 interrupt is asserted.
     * |[11]    |EINT3     |External Interrupt From PD.0 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PD.0 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PD.0 interrupt is asserted.
     * |[12]    |EINT4     |External Interrupt From PE.0 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PE.0 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PE.0 interrupt is asserted.
     * |[13]    |EINT5     |External Interrupt From PF.0 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PF.0 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PF.0 interrupt is asserted.
     * |[14]    |UART0_INT |UART0 Interrupt Flag (Read Only)
     * |        |          |0 = UART1 interrupt is deasserted.
     * |        |          |1 = UART1 interrupt is asserted.
     * |[15]    |UART1_INT |UART1 Interrupt Flag (Read Only)
     * |        |          |0 = UART1 interrupt is deasserted.
     * |        |          |1 = UART1 interrupt is asserted.
     */

